## **Pandas**
- 테이블 형태의 data를 다루는데 최적화된 라이브러리.
- 고성능 array 계산 라이브러리인 NumPy와 통합, 강력한 '스프레드시트' 처리 기능 제공
- 데이터 처리 및 통계 분석을 위해 사용.

In [ ]:
import numpy as np
import pandas as pd

### **Data Loading**

In [ ]:
data_url = "https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data"
df_data = pd.read_csv(data_url, sep='\s+', header=None) # Seperate는 빈 공간(띄어쓰기)으로, Column은 가져오지 않음.

In [ ]:
df_data.head() #처음 다섯줄 가져오기

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [ ]:
#Colunm Header 이름 지정
df_data.columns=['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B','LSTAT','MEDV']
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [ ]:
#data를 NumPy로 가져올 수 있다.
#df_data.values

### **Series**
- DataFrame중 하나의 Column에 해당하는 column vector를 표현하는 object
- NumPy와 다른 점: Index값으로 value에 접근할 수 있고, index를 원하는 형태로 지정할 수 있다
- numpy.ndarray의 subclass
- Duplicate 가능

In [ ]:
from pandas import Series, DataFrame

In [ ]:
# Series는 NumPy를 series로 변환시켜주기 위한 wrapper
data = [1,2,3,4,5]
obj = Series(data = data)
obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# index 지정
index =  ['a','b','c','d','e']
obj = Series(data=data, index=index) # 인덱스 이름을 지정
obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# index 반환
obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
# values 반환
obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [ ]:
# value값은 numpy.ndarray
type(obj.values)

numpy.ndarray

In [ ]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
obj = Series(data=dict_data, dtype=np.float32, name='example_data')
obj         #                데이터 타입 설정,  series 이름 설정
obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: example_data, dtype: float32

In [ ]:
# 인덱스 접근
obj['a']

1.0

In [ ]:
obj = obj.astype(float) #데이터 타입 float64로 변환
#인덱스 값 할당
obj['a']=3.2
obj

In [ ]:
# 값 리스트만
obj.valuess

In [ ]:
# index 리스트만
obj.index

#### **Serise Operation**

In [ ]:
s1 = Series(data=[1,2,3,4,5], index=list('abcde'))
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
# 인덱스 중복 가능
s2 = Series(data=list(range(5,11)), index=list('bcdefe'))
s2

b     5
c     6
d     7
e     8
f     9
e    10
dtype: int64

In [ ]:
#index를 기준으로 연산 수행
#서로 없는 부분의 index 값은 NaN으로 채워진다.
s1.add(s2)
#s1+s2

a     NaN
b     7.0
c     9.0
d    11.0
e    13.0
e    15.0
f     NaN
dtype: float64

### **DataFrame**
- DataTable 전체를 포함하는, Series를 모아서 만든 Object
- 2차원
- index 뿐 아니라 column값도 가지고 있다
- Serise 별 data type으로 각자 다양한 종류의 dtype을 가질 수 있다

In [ ]:
raw_data={'first_name':['Jason', 'Molly', 'Tina'],
          'last_name':['Miller','Jacoabson','Ail'],
          'age':[42,52,36],
          'city':['San Francisco', 'Baltimore', 'Miami']}
# column name = key값, data = value값
df=pd.DataFrame(data=raw_data, columns=['first_name', 'last_name', 'age', 'city']) # columns: 컬럼 선택
df

  first_name  last_name  age           city
0      Jason     Miller   42  San Francisco
1      Molly  Jacoabson   52      Baltimore
2       Tina        Ail   36          Miami

In [ ]:
#dataframe index 접근
df.first_name
#df["first_name"]

0    Jason
1    Molly
2     Tina
Name: first_name, dtype: object

In [ ]:
type(df.first_name)

pandas.core.series.Series

In [ ]:
# csv 변환
df.to_csv('example.csv')

#### **DataFrame Indexing**

#### **loc, iloc**
- loc: 인덱스 이름 기준, 해당 인덱스 이름 까지 슬라이싱
- iloc: 인덱스의 순서, 해당 번째 인덱스 전까지 슬라이싱

In [ ]:
df.loc[:,['last_name']] #list형태로 넣어줘야 함

   last_name
0     Miller
1  Jacoabson
2        Ail

In [ ]:
df['age'].iloc[1:]

1    52
2    36
Name: age, dtype: int64

In [ ]:
# boolean data serise를 'dept' column에 삽입
df = DataFrame(data=raw_data, columns=['first_name','last_name','age','city','debt'])
df

  first_name  last_name  age           city debt
0      Jason     Miller   42  San Francisco  NaN
1      Molly  Jacoabson   52      Baltimore  NaN
2       Tina        Ail   36          Miami  NaN

In [ ]:
# column에 새로운 값 할당
df.debt = df.age > 40
df

  first_name  last_name  age           city   debt
0      Jason     Miller   42  San Francisco   True
1      Molly  Jacoabson   52      Baltimore   True
2       Tina        Ail   36          Miami  False

In [ ]:
values = Series(data=['M','F'], index=[0,1])
values

0    M
1    F
dtype: object

In [ ]:
df

  first_name  last_name  age           city   debt
0      Jason     Miller   42  San Francisco   True
1      Molly  Jacoabson   52      Baltimore   True
2       Tina        Ail   36          Miami  False

In [ ]:
# index를 Series에서 지정해주지 않은 부분은 NaN값이 들어간다.
df['sex'] = values # sex라는 필드를 만들고, values를 넣는다.
df

  first_name  last_name  age           city   debt  sex
0      Jason     Miller   42  San Francisco   True    M
1      Molly  Jacoabson   52      Baltimore   True    F
2       Tina        Ail   36          Miami  False  NaN

In [ ]:
#column 삭제
df.drop('debt', axis=1) # column기준

  first_name  last_name  age           city  sex
0      Jason     Miller   42  San Francisco    M
1      Molly  Jacoabson   52      Baltimore    F
2       Tina        Ail   36          Miami  NaN

In [ ]:
#df는 그대로
df

  first_name  last_name  age           city   debt  sex
0      Jason     Miller   42  San Francisco   True    M
1      Molly  Jacoabson   52      Baltimore   True    F
2       Tina        Ail   36          Miami  False  NaN

In [ ]:
# del은 메모리에서 아예 삭제
del df['debt']
df

  first_name  last_name  age           city  sex
0      Jason     Miller   42  San Francisco    M
1      Molly  Jacoabson   52      Baltimore    F
2       Tina        Ail   36          Miami  NaN

In [ ]:
#'Nevada', 'Ohio'는 Column으로, 2000, 2001, 2002는 index값으로
#JSON 데이터가 가끔 이렇게 넘어온다
pop = {'Nevada':{2001: 2.4, 2002: 2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}
DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### **Selection**

엑셀 파일을 다루기 위한 xlrd설치

In [ ]:
!conda install --y -c anaconda xlrd

Channels:
 - anaconda
 - defaults
Platform: win-64
Collecting package metadata (repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

In [ ]:
df=pd.read_excel('./excel-comp-data.xlsx')
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [ ]:
# 한 개의 column 선택
df['account'].head(3) # 그냥 넣어주면 serise형태로 뽑힌다

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [ ]:
# 한 개 이상의 column 선택
df[['account', 'name', 'street']].head(3) # list 형태로 넣으면 dataframe으로 뽑힌다

   account                        name                                street
0   211829  Kerluke, Koepp and Hilpert                    34456 Sean Highway
1   320563              Walter-Trantow                     1311 Alvis Tunnel
2   648336  Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231

In [ ]:
# Transpose
# 더 깔끔하게 잘 볼 수 있다
df.head().T

,0,1,2,3,4
account,211829,320563,648336,109996,121213
name,"Kerluke, Koepp and Hilpert",Walter-Trantow,"Bashirian, Kunde and Price","D'Amore, Gleichner and Bode",Bauch-Goldner
street,34456 Sean Highway,1311 Alvis Tunnel,62184 Schamberger Underpass Apt. 231,155 Fadel Crescent Apt. 144,7274 Marissa Common
city,New Jaycob,Port Khadijah,New Lilianland,Hyattburgh,Shanahanchester
state,Texas,NorthCarolina,Iowa,Maine,California
postal-code,28752,38365,76517,46021,49681
Jan,10000,95000,91000,45000,162000
Feb,62000,45000,120000,120000,120000
Mar,35000,35000,35000,10000,35000

#### **basic, loc, iloc selection**

In [ ]:
#index 변경
df.index = df['account']
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [ ]:
del df['account']
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [ ]:
#basic
df[['name','street']][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [ ]:
#loc
#row를 쓴 다음 column을 써야 함.
df.loc[[211829, 320563], ['name', 'street']] # index의 값은 명확하게 넣어줘야 함!

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [ ]:
#iloc
df.iloc[:2][:2]

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000

#### **reindex**

In [ ]:
df.index=list(range(0,15))
#df.reset_index(inplace=True)# inplace=True를 해주면 df자체가 변화가 일어남. 안 해주면 df에는 변화가 없음.
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [ ]:
df.reset_index(drop=True).head() #기존의 index가 drop된다.

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### **Drop**

In [ ]:
df.drop(1).head() #df 자체는 변하지 않음. inplace=True해야 df도 변함.

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000

In [ ]:
# 한 개 이상의 index number로 drop
df.drop([0,1,2,3]).head()

,name,street,city,state,postal-code,Jan,Feb,Mar
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000
7,Kovacek-Johnston,91971 Cronin Vista Suite 601,Deronville,RhodeIsland,53461,145000,95000,35000
8,Champlin-Morar,26739 Grant Lock,Lake Juliannton,Pennsylvania,64415,70000,95000,35000

In [ ]:
#axis 지정 축을 기준으로 drop
#column중 city를 삭제하는 코드
df.drop('city', axis=1).head()

,name,street,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,California,49681,162000,120000,35000

### **DataFrame Operation**
- column값과 index를 함께 고려
- Operation types: add, sub, div, mul

In [ ]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [ ]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list('abcd'))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
# dataframe은 column값과 index를 함께 고려
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [ ]:
#fill_value를 하면 NaN값을 0으로 변환
df1.add(df2, fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

In [ ]:
#DataFrame+Series
s1 = Series(data=[10,11,12,13])
#그냥 더하면 NaN값이 나오고, axis를 정해줘야 한다
df2.add(s1, axis=0) #axis를 기준으로 broad casting이 일어남

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

#### **map for series**
- pandas의 series type의 데이터도 map 함수 사용 가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [ ]:
ex = Series(data=[0,1,2,3,4,], index=np.arange(5))
ex

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [ ]:
# lambda 적용
f = lambda x : x ** 2
list(map(f,ex))

[0, 1, 4, 9, 16]

In [ ]:
# 함수 적용
def f(x):
    return x+5
list(map(f,ex))

[5, 6, 7, 8, 9]

In [ ]:
# dict type으로 데이터 교체
# index 1번의 1을 A로, index 2번의 2를 B로, index 3번의 3을 C로
z= {1:'A', 2:'B', 3:'C'}
ex.map(z).head(5)

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [ ]:
# 같은 위치의 데이터를 s2로 전환
s2 = Series(np.arange(10,15))
ex.map(s2).head()

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [ ]:
!wget https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv

--2024-05-22 16:52:43--  https://raw.githubusercontent.com/rstudio/Intro/master/data/wages.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.111.133, 185.199.108.133, 185.199.109.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.111.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 62250 (61K) [text/plain]
Saving to: 'wages.csv'

     0K .......... .......... .......... .......... .......... 82%  345K 0s
    50K ..........                                            100%  793K=0.2s

2024-05-22 16:52:44 (384 KB/s) - 'wages.csv' saved [62250/62250]

In [ ]:
df = pd.read_csv('wages.csv')
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [ ]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
df['sex_code'] = df.sex.map({'male':0, 'female':1})
df.head()

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

#### **replace**
- map 함수에서 데이터 변환 기능만 담당
- 데이터 변환시 많이 사용하는 함수

In [ ]:
#df 값은 바뀌지 않는다
df.sex.replace({'male':0, 'female':1})

0       0
1       1
2       1
3       1
4       1
       ..
1374    0
1375    1
1376    1
1377    0
1378    0
Name: sex, Length: 1379, dtype: int64

#### **apply**
- map과 달리, Series 전체에 해당 함수를 적용.
- 내장 연산 함수(**mean, std, sum** 등)를 사용할 때도 똑같은 효과를 가짐
- scalar 값 이외에 series 값 반환도 가능

In [ ]:
df_info = df[['earn', 'height', 'age']]
f=lambda x : x.max() - x.min()
df_info.apply(f)

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [ ]:
# 내장함수
df_info.sum()
# df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [ ]:
# Series값의 반환
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

#### **applymap for dataframe**
- series 단위가 아닌 모든 element에 함수를 적용.
- series 단위에 apply를 적용시킬 때와 같은 효과

In [ ]:
f = lambda x:-x
df_info.applymap(f).head()
#df_info['column 이름'].apply(f)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

### **Pandas built-in functions**

#### **describe**
- Numeric type 데이터의 요약 정보

In [ ]:
df.describe()

                earn       height           ed          age     sex_code
count    1379.000000  1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499     0.622915
std     31257.070006     3.818108     2.438741    15.789715     0.484832
min       -98.580489    57.340000     3.000000    22.000000     0.000000
25%     10538.790721    63.720000    12.000000    33.000000     0.000000
50%     26877.870178    66.050000    13.000000    42.000000     1.000000
75%     44506.215336    69.315000    15.000000    55.000000     1.000000
max    317949.127955    77.210000    18.000000    95.000000     1.000000

#### **unique**
- series data의 유일한 값을 list로 반환

In [ ]:
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [ ]:
value = list(map(int, np.array(list(enumerate(df['race'].unique())))[:,0].tolist()))
key = np.array(list(enumerate(df['race'].unique())), dtype=str)[:, 1].tolist()
df['race'].replace(to_replace=key, value=value, inplace=True)

value = list(map(int, np.array(list(enumerate(df['sex'].unique())))[:,0].tolist()))
key = np.array(list(enumerate(df['sex'].unique())), dtype=str)[:, 1].tolist()
df['sex'].replace(to_replace=key, value=value, inplace=True)

df

              earn  height  sex  race  ed  age  sex_code
0     79571.299011   73.89    0     0  16   49         0
1     96396.988643   66.23    1     0  16   62         1
2     48710.666947   63.77    1     0  16   33         1
3     80478.096153   63.22    1     1  16   95         1
4     82089.345498   63.08    1     0  17   43         1
...            ...     ...  ...   ...  ..  ...       ...
1374  30173.380363   71.68    0     0  12   33         0
1375  24853.519514   61.31    1     0  18   86         1
1376  13710.671312   63.64    1     0  12   37         1
1377  95426.014410   71.65    0     0  12   54         0
1378   9575.461857   68.22    0     0  12   31         0

[1379 rows x 7 columns]

#### **isnull**
- column 또는 row의 NaN값의 index 반환

In [ ]:
# NaN값이 얼마나 있는지 알 수 있다
df.isnull().sum()

earn        0
height      0
sex         0
race        0
ed          0
age         0
sex_code    0
dtype: int64

#### **sort_values**
- column값을 기준으로 data를 sorting

In [ ]:
df.sort_values(['age','earn'], ascending=True).head()

             earn  height     sex      race  ed  age  sex_code
1038   -56.321979   67.81    male  hispanic  10   22         0
800    -27.876819   72.29    male     white  12   22         0
963    -25.655260   68.90    male     white  12   22         0
1105   988.565070   64.71  female     white  12   22         1
801   1000.221504   64.09  female     white  12   22         1

#### **corr, cov, corrwith**
- corr: 상관계수
- cov: 공분산
- corrwith: 한 column의 dataframe 전체에 대한 상관계수

In [ ]:
df.age.corr(df.earn)

0.07400349177836056

In [ ]:
df.age.cov(df.earn)

36523.69921040891

In [ ]:
df.corrwith(df.earn.astype(int))

earn        1.000000
height      0.291601
sex        -0.337328
race       -0.063977
ed          0.350373
age         0.074003
sex_code   -0.337328
dtype: float64

In [ ]:
#모든 column들간의 상관관계
df.corr()

              earn    height       sex      race        ed       age  sex_code
earn      1.000000  0.291600 -0.337328 -0.063977  0.350374  0.074003 -0.337328
height    0.291600  1.000000 -0.703672 -0.045974  0.114047 -0.133727 -0.703672
sex      -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036  1.000000
race     -0.063977 -0.045974  0.000858  1.000000 -0.049487 -0.056879  0.000858
ed        0.350374  0.114047 -0.061747 -0.049487  1.000000 -0.129802 -0.061747
age       0.074003 -0.133727  0.070036 -0.056879 -0.129802  1.000000  0.070036
sex_code -0.337328 -0.703672  1.000000  0.000858 -0.061747  0.070036  1.000000

In [ ]:
#value들이 각각 얼마나 있는지 나타냄.
#len(df)로 나누면 비율을 얻을 수 있음.
df.sex.value_counts(sort=True) / len(df)

sex
1    0.622915
0    0.377085
Name: count, dtype: float64